#Создать список произвольного содержания.
# Вывести на экран третий, пятый и шестой элементы

my_list = [1, 2, 67, 865, 1233, 2345132]
print(my_list[2], my_list[4], my_list[5])
