# Дан список чисел. Посчитать сколько раз встречается каждое число. Использовать функцию.


def schet(*args):
    for i in args:





def main():
    print(schet(1, 2, 3, 3, 2, 5, 3, 1, 3, 5, 3, 4, 6, 2))


if __name__ == '__main__':
    main()
