# Написать программу для работы с матрицами:
# Создание
# Вывод
# Сумма всех элементов
# Нахождение максимального элемента
# Нахождение минимального элемента.

from random import randint

matrix = [[randint(1, 10) for _ in range(4)] for _ in range(4)]  # Создание матриц (диапазон, колличество)


def my_func("create", 'vyvod', 'summa', 'max_number', 'min_nimber'):
    print()


def main():
    my_func(name)


if __name__ == '__main__':
    main()
