# Дана длина ребра куба.
# Найти объем куба и площадь всей его поверхности.

x = 5

V = x ** 3
print(V)

S = 6 * x ** 2
print(S)
