# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

string_01 = input('User name: ')
print('Hello, ', string_01)
