# Даны действительные числа x и y. Получить
# Для нахождения модуля использовать функцию abs(..)

x = 10
y = 15

print(abs(x - y) / (1 + abs(x * y)))
