# Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран

age_1 = 5

age_2 = age_1 * age_1

age_3 = age_2 - age_1

age_summ = (age_2 + age_3 + age_1) // 3
print(age_summ)
