# Выведите на экран n раз фразу "I am a programmer".
# Число n вводит пользователь.

n_raz = int(input("Сколько раз хочешь вывести фразу на экран? - "))

my_list = (f'I am a programmer')
for i in range(n_raz):
    print(my_list)

