# Выведите на экран n раз фразу "I am a programmer".
# Число n вводит пользователь.

n_raz = input("Сколько раз хочешь вывести фразу на экран? - ")

my_list = (f'I am a programmer')
for my_list in range(n_raz)
    print(my_list)

