# Написать произвольную строку.
# Получить подстроку, которая начинается с пятого символа, заканчивается предпредпоследним символом с шагом три.

my_string = '0123456789'


print(my_string[5:-1:3])
