# Дан список целых чисел.
# Создать новый список, каждый элемент которого равен исходному элементу умноженному на -2
import random

spis = [i for i in range(1, 10)]
spis_2 = []

if element in spis:
    new_element = element * -2
    spis_2.append(new_element)

print(spis_2)

